effects-app/app/controllers/pedals_controller.rb

SELECT "pedals".* FROM "pedals" WHERE "pedals"."name" = $1  [["name", "centaur"]]
---
  def search
    @pedals = Pedal.where(name: params[ :pedal_name])

SELECT "pedals".* FROM "pedals"
---
    def index
        @pedals = Pedal.all

SELECT "pedals".* FROM "pedals" WHERE "pedals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def show
        begin
          @pedal = Pedal.find(params[:id])

INSERT INTO "pedals" ("name", "maker", "effect_subtype", "notable_users", "songs_used_on", "photo", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        @pedal = Pedal.new(pedal_params)

        if @pedal.save

UPDATE "pedals" SET "name" = $1, "updated_at" = $2 WHERE "pedals"."id" = $3  [["name", "CryBaby yyy"], ["updated_at", "2020-03-12 18:59:37.431320"], ["id", 9]]
---
      def update
        if @pedal.update(pedal_params)

DELETE FROM "pedals" WHERE "pedals"."id" = $1  [["id", 4]]
---
      def destroy
        @pedal.destroy

SELECT "pedals".* FROM "pedals" WHERE "pedals"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        def set_pedal
          @pedal = Pedal.find(params[:id])